-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: attendance_db
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `alembic_version`
--

DROP TABLE IF EXISTS `alembic_version`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `alembic_version` (
  `version_num` varchar(32) NOT NULL,
  PRIMARY KEY (`version_num`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `alembic_version`
--

LOCK TABLES `alembic_version` WRITE;
/*!40000 ALTER TABLE `alembic_version` DISABLE KEYS */;
INSERT INTO `alembic_version` VALUES ('add_is_locked_to_employees');
/*!40000 ALTER TABLE `alembic_version` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attendance_records`
--

DROP TABLE IF EXISTS `attendance_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `attendance_records` (
  `id` int NOT NULL AUTO_INCREMENT,
  `employee_id` int NOT NULL,
  `timestamp_in` datetime NOT NULL,
  `status` varchar(50) DEFAULT NULL,
  `photo_path` varchar(255) DEFAULT NULL,
  `device_id` int DEFAULT NULL,
  `shift_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `ix_attendance_records_id` (`id`),
  KEY `idx_attendance_employee` (`employee_id`),
  KEY `idx_attendance_time` (`timestamp_in`),
  KEY `idx_attendance_device` (`device_id`),
  KEY `shift_id` (`shift_id`),
  CONSTRAINT `attendance_records_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE,
  CONSTRAINT `attendance_records_ibfk_2` FOREIGN KEY (`device_id`) REFERENCES `devices` (`id`) ON DELETE SET NULL,
  CONSTRAINT `attendance_records_ibfk_3` FOREIGN KEY (`shift_id`) REFERENCES `shifts` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attendance_records`
--

LOCK TABLES `attendance_records` WRITE;
/*!40000 ALTER TABLE `attendance_records` DISABLE KEYS */;
INSERT INTO `attendance_records` VALUES (47,88,'2025-11-14 20:31:06','present',NULL,1,126),(50,88,'2025-11-15 06:58:42','present',NULL,1,128),(51,72,'2025-11-15 06:59:57','present',NULL,1,129),(53,88,'2025-11-17 16:05:21','present',NULL,1,131),(54,72,'2025-11-17 16:22:15','present',NULL,1,132),(57,88,'2025-11-18 11:00:44','present',NULL,1,133);
/*!40000 ALTER TABLE `attendance_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `devices`
--

DROP TABLE IF EXISTS `devices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `devices` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `location` varchar(100) DEFAULT NULL,
  `api_key` varchar(255) NOT NULL,
  `last_seen` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `api_key` (`api_key`),
  KEY `ix_devices_id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `devices`
--

LOCK TABLES `devices` WRITE;
/*!40000 ALTER TABLE `devices` DISABLE KEYS */;
INSERT INTO `devices` VALUES (1,'Kiosk 1','Sảnh chính','kiosk1key',NULL);
/*!40000 ALTER TABLE `devices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employees`
--

DROP TABLE IF EXISTS `employees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employees` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `department` varchar(100) DEFAULT NULL,
  `role` varchar(255) NOT NULL DEFAULT 'employee',
  `face_embedding` blob,
  `is_locked` tinyint(1) NOT NULL DEFAULT '0',
  `photo_path` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `face_encoding` blob COMMENT '128-dim embedding vector (np.float32)',
  PRIMARY KEY (`id`),
  KEY `ix_employees_id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=89 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employees`
--

LOCK TABLES `employees` WRITE;
/*!40000 ALTER TABLE `employees` DISABLE KEYS */;
INSERT INTO `employees` VALUES (71,'Huy','AI','employee',_binary '\0\0\0��B0@\0\0\0��a2@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\���)@\0\0\0�b\�#@\0\0\0@\�m @\0\0\0\0\0\0\0\0\0\0\0`uz(@\0\0\0@ƽ@\0\0\0��@\0\0\0@\�G\'@\0\0\0\0\0\0\0\0\0\0\0\�M@\0\0\0�\"@\0\0\0\0\0\0\0\0\0\0\0��>@\0\0\0�8S$@\0\0\0�z8@\0\0\0�?1@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@xz(@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�q$6@\0\0\0�8�+@\0\0\0`�\� @\0\0\0\0\�1@\0\0\0�<\�@\0\0\0��@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0 -\�)@\0\0\0�\\V#@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�c*@\0\0\0\0\0\0\0\0\0\0\0\0!\Z%@\0\0\0�b\�\�?\0\0\0\0\0\0\0\0\0\0\0\0!@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�/@\0\0\0\0\0\0\0\0\0\0\0��\�%@\0\0\0\0\0\0\0\0\0\0\0�Dl1@\0\0\0�V3 @\0\0\0\0\0\0\0\0\0\0\0`�+\'@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�>@\0\0\0@\'2@\0\0\0`=�2@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`Ġ*@\0\0\0\0\0\0\0\0\0\0\0��($@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0��\�@\0\0\0`��\r@\0\0\0�\'t,@\0\0\0\0\0\0\0\0\0\0\0`\�@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\��a1@\0\0\0\0\0\0\0\0\0\0\0 ��@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`\�\�:@\0\0\0 �\�\'@\0\0\0@�k\"@\0\0\0\0\0\0\0\0\0\0\0@�g@\0\0\0\0\0\0\0\0\0\0\0@\�&@\0\0\0�U�:@\0\0\0��@\0\0\0@�\'3@\0\0\0@/�@\0\0\0@��8@\0\0\0`Y�4@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`\�#@\0\0\0\0\0\0\0\0\0\0\0 ~�&@\0\0\0 �((@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@�J/@\0\0\0\�	�\�?\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0��\�\�?\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`�<@\0\0\0\0\0\0\0\0\0\0\0\�\n�@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\��Q/@\0\0\0@�\�!@\0\0\0\0\0\0\0\0\0\0\0���;@\0\0\0`#@\0\0\0@P\�,@',0,'emp_638974440365933345_Huy.jpg',NULL,NULL,_binary 'xXq�E\�=��<#�ƽ\�/��r���=y޽*�U[>\��\�\�V>7�����e�\�߽B�S�ʳ,>\�\Z���\�*�\�9\�<��:�\�=�,�a�%<{V\�=Xf\��@Ρ�~\��y���\����B�[x��n�^��%j��MԽе<��=�֋<\Z\�h��^Q>�3\�\�\�C�\�>\'�@=\0�>\�[:>�+�=̃<�\�\'��C>\� ,���\�=\�\�!>�>��\�;ܑ\"��7��\�\�<<m>�9�\�8k=\�> `��%\�o�\�I>6٘=H\�ི\nq�2.\�=���\�̠����<�>�O^/�\�\\��X<(=ϻ�>X\�=۟~���=�j��k�$=(B�=\�$\�=�)��\�\�<(W/�V\0\�;\�X>JJ��\�W��!\0f>\�b:=g?\�=M-g=�S\�<\��-�=o^�,R\�<\�]\�<�|=�\n7���\�=b�\��=\�Lּ\�\�����?¼\��q���\�\0>3\�\\�H>�#,>�\�>K\�\n>\�>@)J=p\�?:^ ��.5q�$\�\"�\�{\n>���|\�>\�\�<'),(72,'Phong','AI','employee',_binary '\0\0\0\�\�\�\n@\0\0\0\�P!@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@\�\�)@\0\0\0@C�@\0\0\0`\��@\0\0\0\0\0\0\0\0\0\0\0 @\�?\0\0\0\0�j@\0\0\0\0\0\0\0\0\0\0\0�!�&@\0\0\0@\�\�@\0\0\0 @\0\0\0���@\0\0\0\0\0\0\0\0\0\0\0`x�\"@\0\0\0\�\�\�\�?\0\0\0�9�!@\0\0\0\0\0\0\0\0\0\0\0 �\�0@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@��@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�@\0\0\0\0\0\0\0\0\0\0\0`��,@\0\0\0\0\0\0\0\0\0\0\0�s\�1@\0\0\0\�8$@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�K)@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0 3˰?\0\0\0\0\0\0\0\0\0\0\0\���@\0\0\0`ѹ2@\0\0\0\0\0\0\0\0\0\0\0@Z$�?\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`\�,@\0\0\0\0\0\0\0\0\0\0\0��M+@\0\0\0\��\�.@\0\0\0�dw@\0\0\0��\r-@\0\0\0\0\0\0\0\0\0\0\0`=/@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`�\�*@\0\0\0\���?\0\0\0\0\�|@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0 ��#@\0\0\0\0\0\0\0\0\0\0\0@�\�2@\0\0\0\0\0\0\0\0\0\0\0��&)@\0\0\0�\�|1@\0\0\0\�D@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@\�3@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�\�\�?\0\0\0\0\0\0\0\0\0\0\0 ��.@\0\0\0\0\0\0\0\0\0\0\0\0�Y @\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�u2@\0\0\0��\�@\0\0\0\0\0\0\0\0\0\0\0�H(0@\0\0\0\0\0\0\0\0\0\0\0�@\0\0\0 �B$@\0\0\0\�\�\�,@\0\0\0�\\g$@\0\0\0`��3@\0\0\0��\�	@\0\0\0 37+@\0\0\0\0\0\0\0\0\0\0\0��\Z(@\0\0\0\0\0\0\0\0\0\0\0`ѐ\Z@\0\0\0\0\0\0\0\0\0\0\0�\�\'@\0\0\0`�\�$@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�}$@\0\0\0\0�}-@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@��-@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�ڇ)@\0\0\0�Mc@\0\0\0\0\0\0\0\0\0\0\0�\�T@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�P�@\0\0\0\��U@\0\0\0\0\0\0\0\0\0\0\0�u7#@\0\0\0@�e@\0\0\0\0�\Z@',0,'emp_638979748708124330_Phong.png',NULL,NULL,_binary '}`��%}\n=X\�f=U���mj��\�\�������\���9�>\Z~�\�\�>ѱ׽�\�a�i&���m\�\�M,>\�\�P�\�󻽐1P=�a��>�>X��\'w#<=\0�=S2\�\�\'��3��\���h�<7as��m�Rb�=`[6��\�O�\�K�;�S\�=ɑ&<H���%oK>�ף��9x��\�\�<9=s\�H>��	>jx\�=�\���\n�6&�={i1�R�6=�>*>\�q=3񠼵H9�)Zi�|�m�}��=�y	����<斖=\�M��l\�5=\�f��\�nv>꙾=\�\\߽\\f\r�]\�=T�!�Ṅ�\�׺=�`���\\� ���\0Pw;�1\�>&/�=މ�\"u=\�\�Ƽծ�\�wH>��@>ȭL��\\P<�[ƽ\�c�;Rf>\�SU�����zQ>\�K��E��=�H��\\B�-lD�\�n=�:��cԻ\�\�;{ݖ�O/\�;Y\�\�=�\�L��\�<\�NZ<�Ch���\r<��;�<��e/�7\n\r>���\�7>�+E>_�\�=�+>c0 >v\�=ND\�<���d��ѥ<��=�\�O�z�\�=`\�I�'),(73,'Phát','AI','employee',_binary '\0\0\0\�}@\0\0\0�&@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�j�1@\0\0\0 \'%$@\0\0\0 \\\�@\0\0\0\0\0\0\0\0\0\0\0\�\�7@\0\0\0���\r@\0\0\0\0\0\0\0\0\0\0\0`�/@\0\0\0 .�@\0\0\0�S\�@\0\0\0ࣙ\"@\0\0\0\0\0\0\0\0\0\0\0�Q�)@\0\0\0\�\�\�@\0\0\0@\�@\0\0\0\0\0\0\0\0\0\0\0`6$,@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`?8!@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�\�@\0\0\0@�=\�?\0\0\0`�2@\0\0\0\0\0\0\0\0\0\0\0�Y5@\0\0\0\0\�\'@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�T(@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`v�?\0\0\0\0\0\0\0\0\0\0\0\0pm@\0\0\0 h�2@\0\0\0\0\0\0\0\0\0\0\0�J\��?\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�\�/@\0\0\0\0\0\0\0\0\0\0\0\0�A.@\0\0\0\�J\�+@\0\0\0\0�x@\0\0\0�Y6-@\0\0\0\0\0\0\0\0\0\0\0�\�2@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�-@\0\0\0�\�\�@\0\0\0@P\\ @\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�k\�$@\0\0\0\0\0\0\0\0\0\0\0@\�`0@\0\0\0\0\0\0\0\0\0\0\0\0+A1@\0\0\0\�%\�1@\0\0\0��\'@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@\�\�4@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\�?\0\0\0\0\0\0\0\0\0\0\0��-@\0\0\0\0\0\0\0\0\0\0\0�^S@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`\�\�?\0\0\0���%@\0\0\0��\�@\0\0\0\0\0\0\0\0\0\0\0\0�\�*@\0\0\0\0\0\0\0\0\0\0\0 �\�@\0\0\0�~*@\0\0\0`\�p+@\0\0\0�$\"@\0\0\0�\�\r7@\0\0\0 �e@\0\0\0@��(@\0\0\0\0\0\0\0\0\0\0\0�Β$@\0\0\0\0\0\0\0\0\0\0\0\�R%@\0\0\0\0\0\0\0\0\0\0\0`\0C@\0\0\0�G�,@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0���!@\0\0\0 \�\�,@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0���)@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@�<%@\0\0\0\0	\�@\0\0\0\0\0\0\0\0\0\0\0\�\�@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�#�\Z@\0\0\0 �<\�?\0\0\0\0\0\0\0\0\0\0\0@� @\0\0\0`&+%@\0\0\0�b[ @',0,'emp_638974441446910353_Phát.jpg',NULL,NULL,_binary '�\�ӽi\�<=j\\.=�\��\�\Z��\�1��ݑ�U\��\�\�\�=0���io{>�ƽ��n�՞��\�=v�\�>܇4�xw���w*<\�Y�<�\�>���<\0\�=V\\=\�ø�IB��{؉��V�<\�\�\�<5|ͽ<\�7=x�x�νi�t=�x>$+\�:ξ;a�$>8��<b]t�\�0�=B/_=O3�>�\�>.P�=9gB<Eg��W\�=�6&�\�t>\�.>�\�>:G\';U\�~���?�\�\�k;��>>\�1�Q�S=@��=������ =�\Z��(\�V>)��=\�\��\�\�/�\�-�=\r����£=o10�\�	Q��nþ\��=|\�\�>T\�=q\�$�Z.=אV��m�;��)>]�:>�\��0��=l���;ϋF>\�Ș�H\��hR`>D���\�\�=W��<�\�=�y��\�Q�;\�\Z�\�\�\�<a���4�P���\�=(\�/�\�tp=����\��̼\�q*��ڽ÷��V�\�=n@��!pN>\0�*>u>�=**>\�>���=�Kx<�a���x_�d\�D��	>\�N\n�B;>ϑ�'),(74,'Quang','AI','employee',_binary '\0\0\0@\��@\0\0\0�\�$@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`\�m(@\0\0\0\��@\0\0\0`9\�@\0\0\0\0\0\0\0\0\0\0\0\�j\�\�?\0\0\0 ��@\0\0\0\0\0\0\0\0\0\0\0\�sX%@\0\0\0�@\0\0\0\0<@\0\0\0\0mZ@\0\0\0\0\0\0\0\0\0\0\0\��\Z\"@\0\0\0\��@\0\0\0@\'�\'@\0\0\0\0\0\0\0\0\0\0\0���*@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�\� @\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0m�#@\0\0\0�L^\�?\0\0\0 \��(@\0\0\0�\�/\�?\0\0\0 �-@\0\0\0��\'!@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0`{D(@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0@��@\0\0\0\0\0\0\0\0\0\0\0�l�@\0\0\0\0M~.@\0\0\0\0\0\0\0\0\0\0\0 w�@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�l�+@\0\0\0\0\0\0\0\0\0\0\0@�t,@\0\0\0 )@\0\0\0`I\�@\0\0\0�q9+@\0\0\0\0\0\0\0\0\0\0\0\���,@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�r�%@\0\0\0�F@\0\0\0���@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0Λ$@\0\0\0\0\0\0\0\0\0\0\0 �i1@\0\0\0\0\0\0\0\0\0\0\0\��\�#@\0\0\0\0�\�/@\0\0\0\�\�@\0\0\0�pT\�?\0\0\0\0\0\0\0\0\0\0\0�4�0@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0?S	@\0\0\0\0\0\0\0\0\0\0\0`ݩ,@\0\0\0\0\0\0\0\0\0\0\0�#@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�X�\�?\0\0\0\0�/@\0\0\0��%@\0\0\0\0\0\0\0\0\0\0\0�]p,@\0\0\0\0\0\0\0\0\0\0\0\�\�@\0\0\0@\�\�\'@\0\0\0�\0�)@\0\0\0 \��&@\0\0\0\�\��0@\0\0\0\0\�!@\0\0\0\�^\�,@\0\0\0\0\0\0\0\0\0\0\0@X�#@\0\0\0\0\0\0\0\0\0\0\0`\rU@\0\0\0\0\0\0\0\0\0\0\0 \�z@\0\0\0�A\�$@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\�\n&@\0\0\0�{)@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�*)@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0 ��#@\0\0\0`��@\0\0\0\0\0\0\0\0\0\0\0��/@\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0�w@\0\0\0@Z\�@\0\0\0\0\0\0\0\0\0\0\0 \�\r)@\0\0\0\0\�;@\0\0\0`�K@',0,'emp_638974440641986719_Quang.jpg',NULL,NULL,_binary '\�\�m�\��<8�=w���ڈ�R7��@\�z�4\�UL >\"@���>\�;�\�\\�[�x�|m�(�8>\�\�O�O0���\�<\�\�Z=�>�u�Ǣ�<\�\�=� ὚`��0K뽜}P�, \�H&��\��5�\�\�=�n%�\�f<T|\0�S��=z$N�M���u[I>\�z<0H��\�3t<\\\�n<�J[>�\�\n>CΝ=f><\�νz\�\�=��n�\�Q[=]�	>H]�=D$�<���L\0���I=�sk=FK�\�l=��=��\�\�\�h=\\\'}��}[>��\�=�\���\���D\�=l\���Ρ�l�=�B*�|&Z�\�0��c�V<H�\�>�\�\�=\�\n\Z��ޝ<4�\�\"<��3\�5>4\�G>`\r);��7��[���p<�k>������\�@W>��A��\�\�=�Dʼ�=��(��*y=�ܽB=�=�\�B;��V�F�\0>G\���\��=\�l����5=^\�\�<}\�/��܏�\�N�=-\�d�$�8>\n�3>7B\�=\���=_�>Zg\�=\�\���;$�\�\\X��\�}\�\�=Ё;\�S\�=`\��'),(87,'Nguyễn Văn Thiện','IT','employee',_binary 'hN\�\�\��<�J=D����ͽ�v��􃽐\�-��\Z8>8���\�1}>ޘR�q\�5�\�l\�+{���\�\0>\��\�%�\'\���\�7=��\�=�jͽ\�\'=9~�<3A齓!��g?\'�k?ɽ\�\�,��Dk�ʖ��X<\�e�5��5LǼb��=\�A��\�rԽ.y0>��G��\���\���q���0>^\�\�=\�\�\�<�D\"=@ �q\�\�=����\�=$\�\�=&3\�=P�<vF=���l�=lI!>t0�yD-=�\�=\\\���(�%��\�n��l>\"�\">RD��\�6)�8�6>�\\�\"Q��5]�=-�\�d}�Gt�� x=\�\�>�=Q�n�J\n�٥\�R$��\�=-\�=hx�G0V=�\'�9:\"<i\�f>��������.\�d>lڻ��=i�<��\�<\�Tc��nS=3�����\�T\�=�\���½\�=�m\0� Q=l\�=4�M��\�μ�����ͽאڽ\�\�\�=v�c�[\�J>\�\� >\�\�=9�>Y��=\��=:�;<����\\�0&=f\�>)o=��b=\�\�\�<',0,'/photos/emp_638987478457877673_Thiện.jpg','0234567891','thainro0305@gmail.com',NULL),(88,'Đặng Văn Thái','IT','employee',_binary '��*��\�=&�X<DW^�̤�����ݝ�s?���/>%`��W��>.��;�(.��\��+�üa>Һ��6˽�Z	=3t<8\�\�=�Q�Ah�<�,\�=/������f�\Z�pbཬ_�<��=\�;	�M\�=�p;�\�ݨ�0V�:O�\�=\�|F<l\\��4C>\�\�0�ܴ=�`\�h�o\�=�\�v>f�6>ƛ�=Xg>=,]��\�\�\�=~\��\�=U�4>s\�\�=\�q\Z=���;o\�L��@\"=�\n�=�A)�\�鼼\�8\�<\0\��5\�>=�K!�Lm�> {\�=!]\�\�\���l+>\rs�\� ���=\�0�\�\�J�\�춾\��<\���>�\�\�=X����\�=�\�\�ϓ@�\�\�=6�>\�A��\�>=\0X��˼2�A>�ڼ$l�V\�M>�Y�\Z_\�=�q�<���<\n$;�\Z\Z=\�6\����D=9�G�>���|h�g\�\�={\'�\�&=�*�<�^=��������\�@�b૽.\�=#|���W>�p&>\�>^=�2@>V��=\�ʼ=�\�H��X��Ek>��\�;\�\�=�ˠ��P\�=\�\Z=',0,'/photos/emp_638987482279907530_Thai.jpg','123456789','skyeverst17@gmail.com',NULL);
/*!40000 ALTER TABLE `employees` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reports`
--

DROP TABLE IF EXISTS `reports`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reports` (
  `id` int NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL,
  `type` varchar(50) NOT NULL,
  `file_path` varchar(255) DEFAULT NULL,
  `created_by` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `created_by` (`created_by`),
  KEY `ix_reports_id` (`id`),
  CONSTRAINT `reports_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reports`
--

LOCK TABLES `reports` WRITE;
/*!40000 ALTER TABLE `reports` DISABLE KEYS */;
INSERT INTO `reports` VALUES (1,'2025-10-14 21:02:00','daily','/reports/daily_20251015.xlsx',1),(14,'2025-11-19 20:48:05','Employee','/reports/Report_Employee_20251119204804.csv',1),(15,'2025-11-19 20:51:09','Attendance','/reports/Report_Attendance_20251119205108.csv',1);
/*!40000 ALTER TABLE `reports` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `shifts`
--

DROP TABLE IF EXISTS `shifts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `shifts` (
  `id` int NOT NULL AUTO_INCREMENT,
  `employee_id` int NOT NULL,
  `date` datetime NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `is_overtime` tinyint(1) NOT NULL DEFAULT '0',
  `overtime_note` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `employee_id` (`employee_id`),
  KEY `ix_shifts_id` (`id`),
  KEY `idx_shifts_overtime` (`is_overtime`,`date`),
  CONSTRAINT `shifts_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shifts`
--

LOCK TABLES `shifts` WRITE;
/*!40000 ALTER TABLE `shifts` DISABLE KEYS */;
INSERT INTO `shifts` VALUES (126,88,'2025-11-14 00:00:00','13:30:00','16:30:00',1,NULL),(128,88,'2025-11-15 00:00:00','08:30:00','11:30:00',1,NULL),(129,72,'2025-11-15 00:00:00','08:30:00','11:30:00',0,NULL),(131,88,'2025-11-17 00:00:00','13:30:00','16:30:00',0,NULL),(132,72,'2025-11-17 00:00:00','13:30:00','16:30:00',0,NULL),(133,88,'2025-11-18 00:00:00','08:30:00','11:30:00',0,NULL),(134,73,'2025-11-18 00:00:00','08:30:00','11:30:00',0,NULL);
/*!40000 ALTER TABLE `shifts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `role` varchar(50) NOT NULL,
  `employee_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  KEY `employee_id` (`employee_id`),
  KEY `ix_users_id` (`id`),
  KEY `idx_users_role` (`role`),
  CONSTRAINT `users_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','$2b$12$kdIEmK3ZMfDaiO1SmwCS3ungSoq0xvRyZCQDg/4uAcqTkzQAZwzVq','Admin',NULL),(35,'testuser','$2b$12$snpsJ6drGmAiUcVUDejcsuV2n6cD19pniZvzgAoRBBqJcPp1BE4gG','employee',NULL),(36,'testemployee01','$2b$12$JhpGcawpAqL3j5QCS0jPXOFsE7ULOAxOXgMmIiwIzfcksm0dhUUI2','employee',NULL),(42,'0234567891','$2a$11$O9jHYgwhi.vwwNZ.4c/E9.rN.td1cq8HGbJd0AHg7hEYQbVCs8l6W','Employee',87),(43,'123456789','$2b$12$IMCXfZE806XPqldqiB6G3.ZySrG7Tiu9tJTbilVivG1L3QExr.v8i','employee',88);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'attendance_db'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-11-26 15:26:02
